# Taps which should be considered core
tap 'homebrew/cask'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask'

# Core bits
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'grep'
brew 'mas'
brew 'tree'

# Core apps
cask 'google-chrome'
cask 'firefox'
cask 'spotify'
cask 'alfred'

# Core fonts
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-code-pro-for-powerline'
cask 'font-roboto-code-pro'
cask 'font-roboto-sans-pro'
cask 'font-roboto-serif-pro'

# Languages and programming tools
brew 'python'
brew 'python3'
brew 'scala'
brew 'sbt'
brew 'ocaml'
brew 'opam'
brew 'r'
cask 'java'
cask 'julia'

# Programming utils
cask 'pyenv'
cask 'pyenv-virtualenv'
cask 'virtualenv'
cask 'anaconda'
brew 'gdal'
brew 'opencv'

# Command line utils
brew 'awscli'
brew 'mysql'
brew 'node'
brew 'yarn'
brew 'nginx'
brew 'moreutils'
brew 'findutils'
brew 'wget'
brew 'curl'
brew 'the_silver_searcher'
brew 'jq'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'ack'
brew 'zsh'
brew 'htop'

# More professional focused apps (e.g. IDEs)
cask 'intellij-idea-ce'
cask 'pycharm-idea-ce'
cask 'rstudio'
cask 'iterm2'
cask 'virtualbox'
cask 'mactex'
# Personal apps
cask 'whatsapp'
cask '1password'
cask 'caffeine'
cask 'flux'
cask 'vlc'
cask 'google-backup-and-sync'
cask 'google-drive'
