tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mas-cli/tap"
tap "rcmdnk/file"
brew "glib"
brew "ack"
brew "apache-spark"
brew "sqlite"
brew "python"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "cask"
brew "cassandra"
brew "ccm"
brew "cmake"
brew "suite-sparse"
brew "coreutils"
brew "curl"
brew "exa"
brew "harfbuzz"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "poppler"
brew "gdal"
brew "geoip"
brew "ghq"
brew "git"
brew "git-flow"
brew "go"
brew "gotop"
brew "openjdk"
brew "gradle"
brew "grep"
brew "htop"
brew "ipython"
brew "jenv"
brew "jq"
brew "node"
brew "jupyterlab"
brew "kotlin"
brew "maven"
brew "maven-completion"
brew "mono"
brew "moreutils"
brew "mysql"
brew "neovim"
brew "nginx"
brew "ocaml"
brew "opam"
brew "opencv"
brew "postgresql"
brew "pyenv"
brew "r"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby"
brew "sbt"
brew "scala"
brew "speedtest-cli"
brew "the_silver_searcher"
brew "tmux"
brew "todo-txt"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mas-cli/tap/mas"
brew "rcmdnk/file/brew-file"
cask "adoptopenjdk"
cask "bartender"
cask "caffeine"
cask "docker"
cask "flux"
cask "font-roboto"
cask "font-roboto-condensed"
cask "google-chrome"
cask "handbrake"
cask "intellij-idea-ce"
cask "istat-menus"
cask "java"
cask "macdown"
cask "mactex"
cask "miniconda"
cask "vlc"
cask "zoom"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Notability", id: 736189492
mas "Xcode", id: 497799835
