
# tap repositories and their packages

tap 'homebrew/core'
brew 'ack'
brew 'apache-spark'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'cask'
brew 'cassandra'
brew 'ccm'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'exa'
brew 'ffmpeg'
brew 'findutils'
brew 'fzf'
brew 'gdal'
brew 'gdbm'
brew 'geoip'
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'git-flow'
brew 'glib'
brew 'go'
brew 'gotop'
brew 'gradle'
brew 'grep'
brew 'harfbuzz'
brew 'htop'
brew 'ipython'
brew 'jenv'
brew 'jq'
brew 'jupyterlab'
brew 'kotlin'
brew 'mackup'
brew 'mas-cli/tap/mas'
brew 'maven'
brew 'maven-completion'
brew 'mono'
brew 'moreutils'
brew 'mysql'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'ocaml'
brew 'opam'
brew 'opencv'
brew 'openjdk'
brew 'openssl@1.1'
brew 'poppler'
brew 'postgresql'
brew 'pyenv'
brew 'python@3.8'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'speedtest-cli'
brew 'sqlite'
brew 'suite-sparse'
brew 'the_silver_searcher'
brew 'tmux'
brew 'todo-txt'
brew 'trash'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-monoid'
cask 'font-roboto'

tap 'homebrew/cask-fonts'

tap 'homebrew/cask-versions'

tap 'homebrew/cask'
cask '1password'
cask 'adoptopenjdk'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'flux'
cask 'freedom'
cask 'github'
cask 'gitter'
cask 'google-chrome'
cask 'handbrake'
cask 'hyper'
cask 'intellij-idea-ce'
cask 'istat-menus'
cask 'java'
cask 'mactex'
cask 'miniconda'
cask 'notion'
cask 'skim'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'vlc'
cask 'whatsapp'

tap 'd12frosted/emacs-plus'

tap 'mas-cli/tap'

tap 'rcmdnk/file'
brew 'rcmdnk/file/brew-file'

# Other Homebrew packages
brew 'python'
brew 'svn'

# App Store applications
mas 'iMovie', id: 408981434
mas 'Magnet', id: 441258766
mas 'Messenger', id: 1480068668
mas 'Notability', id: 736189492
mas 'Xcode', id: 497799835
mas 'LaunchD Task Scheduler', id: 620249105
