# ========================================================= #
# |     CORE BREW TAPS AND INSTALLS                       | #
# ========================================================= #
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# ========================================================= #
# |     COMMAND LINE UTILS AND UNIX BASICS                | #
# ========================================================= #
brew 'git'
brew 'exa'
brew 'trash'
brew 'wget'
brew 'curl'
brew 'jq'
brew 'ack'
brew 'tmux'
brew 'htop'
brew 'gotop'
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'mutt'

# ========================================================= #
# |     PROGRAMMING LANGUAGES AND PACKAGE MANAGMENT       | #
# ========================================================= #
brew 'python'
brew 'python3'
brew 'pyenv'
brew 'scala'
brew 'ocaml'
brew 'r'
brew 'java'
cask 'java8'
brew 'openjdk'
cask 'adoptopenjdk'
cask 'julia'
brew 'sbt'
brew 'opam'
brew 'gradle'
brew 'pyenv'
brew 'node'
brew 'yarn'

# ========================================================= #
# |     DEVELOPMENT TOOLS; IDEs AND TEXT EDITORS          | #
# ========================================================= #
cask 'docker'
brew 'virtualenv'
brew 'pyenv'
brew 'jenv'

cask 'texpad'
cask 'mactex-no-gui'

cask 'rstudio'

cask 'anaconda'
cask 'conda'
cask 'virtualbox'
brew 'apache-spark'

brew 'vim'
brew 'neovim'
cask 'vimr'
cask 'intellij-idea-ce'
cask 'pycharm-ce-with-anaconda-plugin'

cask 'quickgeojson'
brew 'jupyter'


# ========================================================= #
# |     MENUBAR & CORE OS UTILITIES, APPS                 | #
# ========================================================= #
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'google-drive-file-system'
cask 'google-drive'
cask 'istat-menus'


# ========================================================= #
# |     USER FACING APPLICATIONS AND MAC TOOLS            | #
# ========================================================= #
cask '1password'
cask 'google-chrome'
cask 'spotify'
cask 'anki'
cask 'whatsapp'
cask 'vlc'
cask 'zoom'
cask 'qgis'
cask 'notion'
cask 'obsidian'
cask 'hyper'
cask 'detexify'
cask 'handbrake'
